app/Models/modAdministracion/MenuSubmenuModel.php

INSERT INTO `co_menu` (`nombreMenu`, `iconoId`) VALUES ('Informes', '6')
---
    public function insertar($datos)
    {
        $nombreMenu = $this->db->table('co_menu');
        $nombreMenu->insert($datos);

        return $this->db->insertID();