app/Models/modAdministracion/RolModel.php

SELECT *
FROM `wk_rol`
ORDER BY `wk_rol`.`rolId`
---
    public function get($rolId = null)
    {
        if ($rolId === null) {
            return $this->findAll();