app/Models/modAdministracion/RolModMenuModel.php

SELECT co_rol_modulo_menu.rolModuloMenuId as 'id', `co_rol_modulo_menu`.`rolId`, r.nombreRol as 'rol', mod.nombre as 'modulo', m.nombreMenu as 'menu', `mm`.`moduloId`, `mm`.`menuId`
FROM `co_rol_modulo_menu`
JOIN `wk_rol` `r` ON `r`.`rolId` = `co_rol_modulo_menu`.`rolId`
JOIN `co_modulo_menu` `mm` ON `mm`.`moduloMenuId` = `co_rol_modulo_menu`.`moduloMenuId`
JOIN `co_modulo` `mod` ON `mod`.`moduloId` = `mm`.`moduloId`
JOIN `co_menu` `m` ON `m`.`menuId` = `mm`.`menuId`
ORDER BY `co_rol_modulo_menu`.`rolModuloMenuId`
---
    public function getRolMM(){
        return $this->asObject()
        ->select("co_rol_modulo_menu.rolModuloMenuId as 'id', co_rol_modulo_menu.rolId, r.nombreRol as 'rol', mod.nombre as 'modulo', m.nombreMenu as 'menu', mm.moduloId, mm.menuId")
        ->join('wk_rol r','r.rolId = co_rol_modulo_menu.rolId')
        ->join('co_modulo_menu mm','mm.moduloMenuId = co_rol_modulo_menu.moduloMenuId')
        ->join('co_modulo mod','mod.moduloId = mm.moduloId')
        ->join('co_menu m','m.menuId = mm.menuId')
        ->orderBy('co_rol_modulo_menu.rolModuloMenuId')
        ->findAll();

SELECT co_rol_modulo_menu.rolModuloMenuId as 'id', m.nombreMenu as 'menu'
FROM `co_rol_modulo_menu`
JOIN `wk_rol` `r` ON `r`.`rolId` = `co_rol_modulo_menu`.`rolId`
JOIN `co_modulo_menu` `mm` ON `mm`.`moduloMenuId` = `co_rol_modulo_menu`.`moduloMenuId`
JOIN `co_menu` `m` ON `m`.`menuId` = `mm`.`menuId`
WHERE `r`.`rolId` = 'vendors'
ORDER BY `co_rol_modulo_menu`.`rolModuloMenuId`
---
    public function getRolMenu($rolId){
        return $this->asObject()
        ->select("co_rol_modulo_menu.rolModuloMenuId as 'id', m.nombreMenu as 'menu'")
        ->join('wk_rol r','r.rolId = co_rol_modulo_menu.rolId')
        ->join('co_modulo_menu mm','mm.moduloMenuId = co_rol_modulo_menu.moduloMenuId')
        ->join('co_menu m','m.menuId = mm.menuId')
        ->where('r.rolId', $rolId)
        ->orderBy('co_rol_modulo_menu.rolModuloMenuId')
        ->findAll();