app/Views/template/admin_template.php

            <a href="homeMenu">
            <?php
            $modulo = new ModuloModel();
            $mod = $modulo->asArray()->select('m.nombre')->from('co_modulo m')->where('m.moduloId', $session->modulo)->first();
---
SELECT `m`.`nombre`
FROM `co_modulo`, `co_modulo` `m`
WHERE `m`.`moduloId` = '1 '
 LIMIT 1