app/Controllers/modAdministracion/RolController.php

    public function eliminar(){

        $rolId = $_POST['rolId'];

        $Rol = new RolModel();
        $data = ["rolId" => $rolId];

        $nombreRol = $Rol->asArray()->select("nombreRol")
            ->where("rolId", $rolId)->first();

        $respuesta = $Rol->eliminar($data);

        if ($respuesta > 0){

            //PARA REGISTRAR EN BITACORA QUIEN ELIMINO ROL
            $this->bitacora  = new MovimientosModel();
            $hora=new Time('now');
            $session = session('usuario');

            $this->bitacora->save([
                'bitacoraId' => null,
                'usuario' => $session,
                'accion' => 'Eliminó rol',
                'descripcion' => $nombreRol,
                'hora' => $hora,
            ]);
---
SELECT `nombreRol`
FROM `wk_rol`
WHERE `rolId` = '15'
 LIMIT 1
INSERT INTO `wk_bitacora` (`bitacoraId`, `usuario`, `accion`, `descripcion`, `hora`, `fecha`) VALUES (NULL, 'ae16001', 'Eliminó rol', NULL, '2022-08-18 16:46:51', '2022-08-18 16:46:51')