app/Controllers/modAdministracion/SubMenuController.php

SELECT *
FROM `co_submenu`
JOIN `co_menu` ON `co_menu`.`menuId` = `co_submenu`.`menuId`
SELECT *
FROM `co_menu`
JOIN `wk_icono` ON `wk_icono`.`iconoId` = `co_menu`.`iconoId`
---
    public function submenus()
    {
        $submenu = new SubmenuModel();

        $datos = $submenu->listarMenu();

        $mensaje = session('mensaje');

        $data = [
            "datos"     => $datos,
            "submenu"     => $submenu->select()->asObject()->join('co_menu','co_menu.menuId = co_submenu.menuId')->findAll(),
            "mensaje"   => $mensaje
        ];