app/Models/modProceso/ActividadModel.php

    public function listarActividad($etapaId)
    {
        return $this->asObject()
        ->select("wk_actividad.actividadId as 'id', wk_actividad.nombreActividad as 'nombre', wk_actividad.descripcion as 'descripcion', e.nombreEtapa as 'etapa', wk_actividad.etapaId, pe.nombres as 'persona', wk_actividad.personaId")
        ->join('wk_etapa e','e.etapaId = wk_actividad.etapaId')
        ->join('wk_persona pe','pe.personaId = wk_actividad.personaId')
        ->where('e.etapaId',$etapaId)
        ->orderBy('wk_actividad.actividadId')
        ->findAll();
---
SELECT wk_actividad.actividadId as 'id', wk_actividad.nombreActividad as 'nombre', wk_actividad.descripcion as 'descripcion', e.nombreEtapa as 'etapa', `wk_actividad`.`etapaId`, pe.nombres as 'persona', `wk_actividad`.`personaId`
FROM `wk_actividad`
JOIN `wk_etapa` `e` ON `e`.`etapaId` = `wk_actividad`.`etapaId`
JOIN `wk_persona` `pe` ON `pe`.`personaId` = `wk_actividad`.`personaId`
WHERE `e`.`etapaId` = '2'