app/Models/modProceso/ProcesoModel.php

SELECT wk_proceso.procesoId as 'id', wk_proceso.nombreProceso as 'nombre', tp.tipoProceso as 'tipoProceso'
FROM `wk_proceso`
JOIN `wk_tipo_proceso` `tp` ON `tp`.`tipoProcesoId` = `wk_proceso`.`tipoProcesoId`
ORDER BY `wk_proceso`.`procesoId`
---
    public function listarProceso()
    {
        return $this->asObject()
        ->select("wk_proceso.procesoId as 'id', wk_proceso.nombreProceso as 'nombre', tp.tipoProceso as 'tipoProceso'")
        ->join('wk_tipo_proceso tp','tp.tipoProcesoId = wk_proceso.tipoProcesoId')
        ->orderBy('wk_proceso.procesoId')
        ->findAll();

SELECT *
FROM `wk_proceso`, `wk_tipo_proceso`
ORDER BY `wk_tipo_proceso`.`tipoProcesoId`
---
    public function listarTipoProceso()
    {
        return $this->asObject()
        ->select("*")
        ->from('wk_tipo_proceso')
        ->orderBy('wk_tipo_proceso.tipoProcesoId')
        ->findAll();

INSERT INTO `wk_proceso` (`nombreProceso`, `tipoProcesoId`) VALUES ('Calificacion Institucional', '1')
---
    public function insertar($datos){

        $nombreProceso = $this->db->table('wk_proceso');
        $nombreProceso->insert($datos);