app/Controllers/PerfilController.php

SELECT `b`.`fecha`, `b`.`accion`, `b`.`descripcion`
FROM `wk_bitacora`, `wk_bitacora` `b`
WHERE `b`.`usuario` = 'AE16001'
GROUP BY `b`.`bitacoraId`
---
            ->where('u.usuario'         , $user)
            ->groupBy('u.usuarioId')->findAll(),

            "actividad" => $actividad->asObject()
            ->select('b.fecha, b.accion, b.descripcion')
            ->from('wk_bitacora b')
            ->where('b.usuario',$user)
            ->groupBy('b.bitacoraId')->findAll(),